#+begin_export html
---
layout: post
title: A length-indexed Vector in Rust
permalink: /:title/
tags: [haskell rust]
mathjax: true
---
#+end_export

#+begin_quote
Sneak peeking at Dependent-types and an encoding of length-indexed vectors in Rust to constraint /consumers/ on operations they can perform.
#+end_quote
--------------

It's customary to introduce [[https://en.wikipedia.org/wiki/Dependent_type][Dependent Types]] with vectors (or lists) parameterized by a type ~A~, indexed by a type ~N~ of [[https://en.wikipedia.org/wiki/Peano_axioms][Peano]]-encoded (unary) natural numbers, and two constructors:

- ~VEmpty~: an empty vector has ~N~ equal ~Zero~ ($0$)
- ~VCons~: adding an element into a vector with length ~N~ gives back a vector with length ~Succ(N)~ ($N + 1$)

From there, we implement all sorts of useful operations and establish relationships between input/output vectors and ~N~ via constructors to provide neat guarantees, such as:

1. Accessing the first element of is only allowed on ~IndexedVec<Succ<N>>~ for some ~N~, i.e. it's impossible to read from an empty vector
2. Mapping an ~IndexedVec<A, N>~ with ~f: A -> B~ gives us an ~IndexedVec<B, N>~, i.e. mapping preserves the length
3. Appending an ~IndexedVec<A, M>~ onto ~IndexedVec<A, N>~ gives us an ~IndexedVec<A, N + M~
4. Zipping two vectors is only allowed when they have the same length

* Haskell encoding

To start off, let's write it in Haskell with just enough GHC extensions enabled to get us "[[https://wiki.haskell.org/Dependent_type][close]]" to dependent typing:

#+begin_src haskell :tangle main.hs
{-# LANGUAGE DataKinds #-}
{-# LANGUAGE GADTs #-}
{-# LANGUAGE TypeFamilies #-}

import GHC.Types (Type)

data Nat = Zero | Succ Nat deriving Show

type family Add n m where
  Add Zero     m = m
  Add (Succ n) m = Succ (Add n m)

data IndexedVec (a :: Type) (n :: Nat) where
  VEmpty :: IndexedVec a Zero                           -- an empty vector has length 0
  VCons :: a -> IndexedVec a n -> IndexedVec a (Succ n) -- add an element to vector increments its length

deriving instance (Show a) => Show (IndexedVec a n)
#+end_src

#+RESULTS:
With this encoding, we can implement typical functions over vectors, e.g.:

#+begin_src haskell :tangle main.hs
ivhead :: IndexedVec a (Succ n) -> a
ivhead (VCons a _) = a
-- >>> ivhead (1 `VCons` VEmpty)

ivmap :: (a -> b) -> IndexedVec a n -> IndexedVec b n
ivmap _ VEmpty = VEmpty
ivmap f (VCons a as) = VCons (f a) (ivmap f as)
-- >>> ivmap (+10) (1 `VCons` VEmpty)

ivappend :: IndexedVec a n -> IndexedVec a m -> IndexedVec a (Add n m)
ivappend VEmpty       ys = ys
ivappend (VCons x xs) ys = VCons x (ivappend xs ys)
-- >>> ivappend (1 `VCons` VEmpty) (2 `VCons` VEmpty)

ivzip :: IndexedVec a n -> IndexedVec b n -> IndexedVec (a, b) n
ivzip VEmpty VEmpty = VEmpty
ivzip (VCons a as) (VCons b bs) = VCons (a, b) (ivzip as bs)
-- >>> ivzip (1 `VCons` VEmpty) ("a" `VCons` VEmpty)
#+end_src

#+RESULTS:

It's particularly interesting to note that ~ivhead~ is a /total-function/: we specify ~Succ m~ in the signature, so GHC knows that only ~VCons~ inhabits such a type and therefore the ~VEmpty~ case isn't needed -- consumers can't call into this function with an empty vector. Similarly, in ~ivzip~, by pattern-matching on the constructors, we refine ~N~, such that if the left vector was ~VEmpty~, then the right must be too (the same applies to ~VCons~).

We could keep on implementing more functions (as I did [[https://github.com/rvarago/playground/blob/main/haskell/Vec/Main.hs][here]] or even better go to a full implementation like in the [[https://hackage.haskell.org/package/vec][vec]] package), but that'd require more effort and what we already have is enough to illustrate the point:

#+begin_quote
The more correctness properties we encode into types, the more we get from the type-system.
#+end_quote

Additionally, we've made it impossible to construct invalid vectors. For instance, an empty vector with a length different from ~Zero~ or adding an element into a vector with length ~N~ not producing a vector with length ~Succ(N)~.

This means that an ~IndexedVec<A, N>~ is valid *by construction* and that's a strong guarantee.

We ensure both:
- /consumers/ can only ever see valid vectors
- /implementers/ of functions on vectors must obey the constraints imposed by the constructors

Now, some errors due to consumers misusing our API or implementers building incorrect implementations are *type errors*.

#+begin_quote
By the way, there is a deeper relationship between constraints and guarantees that we might explore someday. Check this presentation [[https://www.youtube.com/watch?v=GqmsQeSzMdw][Constraints liberate, liberate constraints]] for ideas.
#+end_quote

